Config/AccumulationRegisters/ОборотыРасчетовСУчредителями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыРасчетовСУчредителями</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтоимостьУвеличение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьУменьшение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизацияУвеличение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АмортизацияУменьшение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Config/InformationRegisters/СобытияОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияОС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПричинаСписания</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобытийОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/ТипыПлановСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыПлановСчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляКазенных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляБюджетных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляАвтономных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыСобытийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыСобытийОС</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятиеКУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннееПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переоценка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реконструкция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочие состояния (пользовательские)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаВАренду</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВБезвозмездноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзБезвозмездногоПользования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Консервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расконсервация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВЛичноеПользование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзЛичногоПользования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/КВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>КВД</Name>
			<Comment>Коды финансового обеспечения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
					<Comment>Деятельность, осуществляемая за счет средств соответствующего бюджета бюджетной системы Российской Федерации (бюджетная деятельность)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внебюджет</Name>
					<Comment>Приносящая доход деятельность (собственные доходы учреждения)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременноеРаспоряжение</Name>
					<Comment>Средства во временном распоряжении</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаГосзадание</Name>
					<Comment>Деятельность по выполнению государственного (муниципального) задания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СубсидииНаИныеЦели</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на иные цели, грантов в форме субсидий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БюджетныеИнвестиции</Name>
					<Comment>Деятельность, осуществляемая за счет средств субсидии на цели осуществления капитальных вложений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СредстваОМС</Name>
					<Comment>Деятельность, осуществляемая по обязательному медицинскому страхованию</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/AccumulationRegisters/ОборотыРасчетовСУчредителями/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

// Формирует обороты по регистру накопления "ОборотыРасчетовСУчредителями" при записи движений
// по регистру бухгалтерии.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - документ-ссылка, формирующий движения по регистру бухгалтерии
//  НаборЗаписейБУ - РегистрНакопленияНаборЗаписей.ЖурналПроводокЕПСБУ - набор записей регистра бухгалтерии, который записывается документом
Процедура СформироватьОборотыОЦИ(ДокументСсылка, НаборЗаписейБУ) Экспорт
	
	Если НЕ ДокументСсылка.Метаданные().Движения.Содержит(Метаданные.РегистрыНакопления.ОборотыРасчетовСУчредителями) Тогда
		Возврат;
	КонецЕсли;	
	
	ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "Организация, Дата");
	Организация   = ДанныеДокумента.Организация;
	ДатаПроведения = ДанныеДокумента.Дата;
	Если ТипЗнч(НаборЗаписейБУ) = Тип("РегистрБухгалтерииНаборЗаписей.ЖурналПроводокЕПСБУ") И НаборЗаписейБУ.Количество() > 0 Тогда
		ДатаПроведения = НаборЗаписейБУ[0].Период;
	КонецЕсли;	

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УчетнаяПолитика.Организация КАК Организация,
	|	УчетнаяПолитика.РасчетыСУчредителемКорректироватьОборотами КАК РасчетыСУчредителемКорректироватьОборотами,
	|	УчетнаяПолитика.СтруктураРПС.ТипПланаСчетов КАК ТипРПС
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&ДатаУП, Организация = &Организация) КАК УчетнаяПолитика";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаУП", ДатаПроведения);
	
	ТипРПС = Неопределено;
	РасчетыСУчредителемКорректироватьОборотами = Неопределено;
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	Если Выборка.Следующий() Тогда
		ТипРПС = Выборка.ТипРПС;
		РасчетыСУчредителемКорректироватьОборотами = Выборка.РасчетыСУчредителемКорректироватьОборотами;
	КонецЕсли;	                      
	
	Если РасчетыСУчредителемКорректироватьОборотами = Неопределено ИЛИ НЕ РасчетыСУчредителемКорректироватьОборотами Тогда
		// Если в учетной политике не установлена опция корректировки расчетов с учредителем оборотами, то 
		// обороты ОЦИ, изменяющие расчеты с учредителем, не формируем
		Возврат;
	КонецЕсли;	
	
	РПС_БУ = ПредопределенноеЗначение("Перечисление.ТипыПлановСчетов.ДляБюджетных");
	РПС_АУ = ПредопределенноеЗначение("Перечисление.ТипыПлановСчетов.ДляАвтономных");

	РПС_БУиАУ = Новый Массив;
	РПС_БУиАУ.Добавить(РПС_БУ);
	РПС_БУиАУ.Добавить(РПС_АУ);
	Если ТипРПС = Неопределено ИЛИ РПС_БУиАУ.Найти(ТипРПС) = Неопределено Тогда
		// Движения формируем только для бюджетных или автономных учреждений
		Возврат;
	КонецЕсли;	
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Проводки.Организация КАК Организация,
	|	Проводки.Период КАК Период,
	|	Проводки.ИФО КАК ИФО,
	|	Проводки.КФО КАК КФО,
	|	Проводки.СчетДт КАК СчетДт,
	|	Проводки.СчетКт КАК СчетКт,
	|	ВЫБОР
	|		КОГДА Проводки.СубконтоДт1 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА Проводки.ПодразделениеДт
	|		КОГДА Проводки.СубконтоКт1 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА Проводки.ПодразделениеКт
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Подразделение,
	|	ВЫБОР
	|		КОГДА Проводки.СубконтоДт1 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА Проводки.СубконтоДт1
	|		КОГДА Проводки.СубконтоКт1 ССЫЛКА Справочник.ОсновныеСредства
	|			ТОГДА Проводки.СубконтоКт1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ОсновноеСредство,
	|	Проводки.Сумма КАК Сумма
	|ПОМЕСТИТЬ Проводки
	|ИЗ
	|	&Проводки КАК Проводки
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СобытияОССрезПоследних.ОсновноеСредство КАК ОсновноеСредство
	|ПОМЕСТИТЬ ВТ_Изменения
	|ИЗ
	|	РегистрСведений.СобытияОС.СрезПоследних(
	|			&ДатаПроведения,
	|			Организация = &Организация
	|				И Событие = ЗНАЧЕНИЕ(Перечисление.ВидыСобытийОС.ПринятиеКУчету)
	|				И ОсновноеСредство В
	|					(ВЫБРАТЬ
	|						Таб.ОсновноеСредство
	|					ИЗ
	|						Проводки КАК Таб)) КАК СобытияОССрезПоследних
	|ГДЕ
	|	СобытияОССрезПоследних.ДатаСобытия < &ДатаИзменения
	|
	|СГРУППИРОВАТЬ ПО
	|	СобытияОССрезПоследних.ОсновноеСредство
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Проводки.Организация КАК Организация,
	|	Проводки.Период КАК Период,
	|	Проводки.ИФО КАК ИФО,
	|	Проводки.КФО КАК КФО,
	|	Проводки.Подразделение КАК Подразделение,
	|	СУММА(ВЫБОР
	|			КОГДА Проводки.КФО = &КФО4
	|					И Проводки.СчетДт В (&Счета4)
	|					И НЕ Проводки.СчетКт В (&Счета4)
	|				ТОГДА Проводки.Сумма
	|			КОГДА &ТипРПС = &РПС_БУ
	|					И Проводки.КФО = &КФО2
	|					И Проводки.СчетДт В (&Счета2)
	|					И НЕ Проводки.СчетКт В (&Счета2)
	|				ТОГДА Проводки.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СтоимостьУвеличение,
	|	СУММА(ВЫБОР
	|			КОГДА Проводки.КФО = &КФО4
	|					И Проводки.СчетДт В (&СчетаАм4)
	|					И НЕ Проводки.СчетКт В (&СчетаАм4)
	|				ТОГДА Проводки.Сумма
	|			КОГДА &ТипРПС = &РПС_БУ
	|					И Проводки.КФО = &КФО2
	|					И Проводки.СчетДт В (&СчетаАм2)
	|					И НЕ Проводки.СчетКт В (&СчетаАм2)
	|				ТОГДА Проводки.Сумма
	|			КОГДА НЕ ВТ_Изменения.ОсновноеСредство ЕСТЬ NULL
	|					И Проводки.КФО В (&КФОИзменения)
	|					И Проводки.СчетДт В (&СчетаАмИзменения)
	|					И НЕ Проводки.СчетКт В (&СчетаАмИзменения)
	|				ТОГДА Проводки.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК АмортизацияУменьшение,
	|	СУММА(ВЫБОР
	|			КОГДА Проводки.КФО = &КФО4
	|					И Проводки.СчетКт В (&Счета4)
	|					И НЕ Проводки.СчетДт В (&Счета4)
	|				ТОГДА Проводки.Сумма
	|			КОГДА &ТипРПС = &РПС_БУ
	|					И Проводки.КФО = &КФО2
	|					И Проводки.СчетКт В (&Счета2)
	|					И НЕ Проводки.СчетДт В (&Счета2)
	|				ТОГДА Проводки.Сумма
	|			КОГДА НЕ ВТ_Изменения.ОсновноеСредство ЕСТЬ NULL
	|					И Проводки.КФО В (&КФОИзменения)
	|					И Проводки.СчетКт В (&СчетаИзменения)
	|					И НЕ Проводки.СчетДт В (&СчетаИзменения)
	|				ТОГДА Проводки.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СтоимостьУменьшение,
	|	СУММА(ВЫБОР
	|			КОГДА Проводки.КФО = &КФО4
	|					И Проводки.СчетКт В (&СчетаАм4)
	|					И НЕ Проводки.СчетДт В (&СчетаАм4)
	|				ТОГДА Проводки.Сумма
	|			КОГДА &ТипРПС = &РПС_БУ
	|					И Проводки.КФО = &КФО2
	|					И Проводки.СчетКт В (&СчетаАм2)
	|					И НЕ Проводки.СчетДт В (&СчетаАм2)
	|				ТОГДА Проводки.Сумма
	|			КОГДА НЕ ВТ_Изменения.ОсновноеСредство ЕСТЬ NULL
	|					И Проводки.КФО В (&КФОИзменения)
	|					И Проводки.СчетКт В (&СчетаАмИзменения)
	|					И НЕ Проводки.СчетДт В (&СчетаАмИзменения)
	|				ТОГДА Проводки.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК АмортизацияУвеличение
	|ИЗ
	|	Проводки КАК Проводки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Изменения КАК ВТ_Изменения
	|		ПО (ВТ_Изменения.ОсновноеСредство = Проводки.ОсновноеСредство)
	|
	|СГРУППИРОВАТЬ ПО
	|	Проводки.Организация,
	|	Проводки.Период,
	|	Проводки.ИФО,
	|	Проводки.КФО,
	|	Проводки.Подразделение
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВЫБОР
	|				КОГДА Проводки.КФО = &КФО4
	|						И Проводки.СчетДт В (&Счета4)
	|						И НЕ Проводки.СчетКт В (&Счета4)
	|					ТОГДА Проводки.Сумма
	|				КОГДА &ТипРПС = &РПС_БУ
	|						И Проводки.КФО = &КФО2
	|						И Проводки.СчетДт В (&Счета2)
	|						И НЕ Проводки.СчетКт В (&Счета2)
	|					ТОГДА Проводки.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА Проводки.КФО = &КФО4
	|						И Проводки.СчетДт В (&СчетаАм4)
	|						И НЕ Проводки.СчетКт В (&СчетаАм4)
	|					ТОГДА Проводки.Сумма
	|				КОГДА &ТипРПС = &РПС_БУ
	|						И Проводки.КФО = &КФО2
	|						И Проводки.СчетДт В (&СчетаАм2)
	|						И НЕ Проводки.СчетКт В (&СчетаАм2)
	|					ТОГДА Проводки.Сумма
	|				КОГДА НЕ ВТ_Изменения.ОсновноеСредство ЕСТЬ NULL
	|						И Проводки.КФО В (&КФОИзменения)
	|						И Проводки.СчетДт В (&СчетаАмИзменения)
	|						И НЕ Проводки.СчетКт В (&СчетаАмИзменения)
	|					ТОГДА Проводки.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА Проводки.КФО = &КФО4
	|						И Проводки.СчетКт В (&Счета4)
	|						И НЕ Проводки.СчетДт В (&Счета4)
	|					ТОГДА Проводки.Сумма
	|				КОГДА &ТипРПС = &РПС_БУ
	|						И Проводки.КФО = &КФО2
	|						И Проводки.СчетКт В (&Счета2)
	|						И НЕ Проводки.СчетДт В (&Счета2)
	|					ТОГДА Проводки.Сумма
	|				КОГДА НЕ ВТ_Изменения.ОсновноеСредство ЕСТЬ NULL
	|						И Проводки.КФО В (&КФОИзменения)
	|						И Проводки.СчетКт В (&СчетаИзменения)
	|						И НЕ Проводки.СчетДт В (&СчетаИзменения)
	|					ТОГДА Проводки.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА Проводки.КФО = &КФО4
	|						И Проводки.СчетКт В (&СчетаАм4)
	|						И НЕ Проводки.СчетДт В (&СчетаАм4)
	|					ТОГДА Проводки.Сумма
	|				КОГДА &ТипРПС = &РПС_БУ
	|						И Проводки.КФО = &КФО2
	|						И Проводки.СчетКт В (&СчетаАм2)
	|						И НЕ Проводки.СчетДт В (&СчетаАм2)
	|					ТОГДА Проводки.Сумма
	|				КОГДА НЕ ВТ_Изменения.ОсновноеСредство ЕСТЬ NULL
	|						И Проводки.КФО В (&КФОИзменения)
	|						И Проводки.СчетКт В (&СчетаАмИзменения)
	|						И НЕ Проводки.СчетДт В (&СчетаАмИзменения)
	|					ТОГДА Проводки.Сумма
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Проводки", НаборЗаписейБУ.Выгрузить());
	
	КФО4 = ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаГосзадание");
	КФО2 = ПредопределенноеЗначение("Перечисление.КВД.Внебюджет");
	КФО7 = ПредопределенноеЗначение("Перечисление.КВД.СредстваОМС");
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ДатаПроведения", ДатаПроведения);
	Запрос.УстановитьПараметр("ТипРПС", ТипРПС);
	Запрос.УстановитьПараметр("РПС_БУ", РПС_БУ);
	Запрос.УстановитьПараметр("КФО4", ПредопределенноеЗначение("Перечисление.КВД.СубсидииНаГосзадание"));
	Запрос.УстановитьПараметр("КФО2", ПредопределенноеЗначение("Перечисление.КВД.Внебюджет"));
	Запрос.УстановитьПараметр("Счета2", БухгалтерскийУчет.СписокСчетов("101.10,103.11"));
	Запрос.УстановитьПараметр("Счета4", БухгалтерскийУчет.СписокСчетов("101.10,101.20,102.20,103.11"));
	Запрос.УстановитьПараметр("СчетаАм2", БухгалтерскийУчет.СписокСчетов("104.10"));
	Запрос.УстановитьПараметр("СчетаАм4", БухгалтерскийУчет.СписокСчетов("104.10,104.20,104.29"));
	
	ДанныеУП = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПолучитьДатуИзмененияТипаУчреждения(Организация, ДатаПроведения);
	Запрос.УстановитьПараметр("ДатаИзменения", ДанныеУП.ДатаИзменения);
	
	СчетИзменения	= ?(ТипРПС = РПС_БУ, "", "101.10,") + "101.20,102.20";
	СчетАмИзменения	= ?(ТипРПС = РПС_БУ, "", "104.10,") + "104.20,104.29";
	
	Запрос.УстановитьПараметр("СчетаИзменения", БухгалтерскийУчетПовтИсп.СписокСчетов(СчетИзменения));
	Запрос.УстановитьПараметр("СчетаАмИзменения", БухгалтерскийУчетПовтИсп.СписокСчетов(СчетАмИзменения));

	КФОИзменения = Новый Массив;
	КФОИзменения.Добавить(КФО2);
	КФОИзменения.Добавить(КФО7);
	Запрос.УстановитьПараметр("КФОИзменения", КФОИзменения);
	
	ТабЗаписей = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(ДокументСсылка);  
	НаборЗаписей.Записывать = Истина;
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;	
	НаборЗаписей.Загрузить(ТабЗаписей);  
	
	Если НаборЗаписей.Количество() <> 0 Тогда
		НаборЗаписей.Записать(Истина);
	КонецЕсли;	
	
КонецПроцедуры		

#КонецОбласти

#КонецЕсли
